package cn.studyjams.s1.sj52.staffmanagementsystem;

import android.os.Parcel;
import android.os.Parcelable;
import android.provider.Settings;

import com.google.gson.Gson;

/**
 * Created by 1 on 2016/10/20.
 */

public class DataBase {         //所有人员信息数据


     String [] deptNames = new String[]{"行政部","行政部","行政部","行政部","行政部","行政部",
            "财务部","财务部","财务部","财务部",
            "技术部","技术部","技术部","技术部","技术部","技术部","技术部","技术部","技术部","技术部","技术部","技术部","技术部","技术部","技术部","技术部",
            "技术部","技术部","技术部","技术部","技术部","技术部","技术部","技术部","技术部",
            "销售部","销售部","销售部","销售部","销售部","销售部","销售部","销售部","销售部","销售部",
            "管理层","管理层","管理层","管理层"};                                                    //部门
     String [] staffsName = new String[]{"张晓楠","石玉兰","尚文清","杜喜喜","杨海清","孙丽萍","丁冬芹","陈桂平","李开英",
            "张凤霞","杜茂仁","李金云","石俊梅","戴双宝",
            "杜元晓","刘文明","王焕锁","高文利","张海宝","孙瑞军","高文军","张飞雄","石胜厚","刘御","高志新","尚文忠",
            "刘双正","郭山彤","康志强","马仁毅","尤帅齐","孙彩武","邬肖任","赵单羽","陈自萤","文彩依","顾西风","苏普","马力峰","李正","李小帆",
            "王丽婧","柳辰飞","余少虹","胡丹丹","彭玉林","卢兰凤","刘彬彬","任青"};                  //姓名
     String [] staffNumbers = new String[]{"101","102","103","104","105","106","201","202","203","204","301","302","303",
            "304","305","306","307","308","309","310","311","312","313","314","315","316","317","318","319","320","321","322",
            "323","324","325",
            "401","402","403","404","405","406","407","408","409","410","801","802","803","804"};    //员工号
     String [] avatar = new String[]{"staff_101","staff_102","staff_103","staff_104","staff_105","staff_106",
            "staff_201","staff_202","staff_203","staff_204",
            "staff_301","staff_302","staff_303","staff_304","staff_305","staff_306","staff_307","staff_308",
            "staff_309","staff_310","staff_311","staff_312","staff_313","staff_314","staff_315","staff_316","staff_317","staff_317","staff_318","staff_319",
            "staff_320","staff_321","staff_322","staff_323","staff_324","staff_325",
            "staff_401","staff_402","staff_403","staff_404","staff_405","staff_406","staff_407","staff_408","staff_409","staff_410",
            "staff_801","staff_802","staff_803","staff_804"};  // 头像
    String [] position = new String[]{"行政文员","行政文员","行政文员","行政主管","行政文员","行政文员",
            "财务主管","财务科员","财务科员","财务科员",
            "技术员","技术员","技术员","技术员","技术组长","技术员","技术员","技术员","技术员","技术员","技术员",
            "技术员","技术员","技术员","技术员","技术员","技术员","技术员","技术员","技术员","技术员","技术员","技术员","技术副组长","技术主管",
            "销售经理","销售员","销售员","销售员","销售员","销售员","销售员","销售主管","销售员","销售员",
            "董事长","总经理","副总经理","副总经理" };                                               //职位名称
    String [] sex = new String[]{"女性","女性","女性","女性","女性","女性",
            "女性","女性","女性","女性","男性","男性","男性","男性","男性","男性","男性","男性","男性","男性","男性","男性","男性","男性","男性",
            "男性","男性","男性","男性","男性","男性","男性","男性","男性","男性","男性","女性","女性","女性","男性","男性","男性","男性","男性","男性",
            "女性","男性","女性","男性"};  //性别
    String [] nativePlace = new String[]{"上海市","枣庄市","烟台市","临汾市","济宁市","徐州市","青岛市","海阳市","济宁市","巩义市",
            "长春市","无锡市","常州市","烟台市","济宁市","上海市","海阳市","常熟市","天津市","墨尔本","苏州市","东台市",
            "北京市","宿迁市","重庆市","泰兴市","泰安市","日照市","聊城市","开封市","上海市","武汉市","上海市","丹阳市","无锡市",
            "男性","女性","女性","女性","男性","男性","男性","男性","男性","男性","女性","男性","女性","男性"};  //籍贯
    String [] nationalities = new String[]{"中国","中国","中国","中国","中国","中国","中国","中国","中国","中国",
            "中国","中国","中国","中国","中国","中国","中国","中国","中国","澳大利亚","中国","中国","中国",
            "中国","中国","中国","中国","中国","中国","中国","中国","中国","中国","中国","中国",
            "中国","中国","中国","中国","中国","中国","中国","中国","中国","中国","中国","中国","中国","中国"};  //国籍
    String [] nation = new String[]{"汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族",
            "汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族","/","汉族","汉族","汉族","汉族","汉族"
            ,"汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族",
            "汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族","汉族"};   //民族
    String [] maternityStatus = new String[]{"未婚","未婚","已婚","已婚","未婚","已婚","已婚","未婚","已婚","未婚",
            "未婚","未婚","已婚","未婚","未婚","未婚","未婚","已婚","未婚","未婚","未婚","未婚","未婚",
            "未婚","未婚","未婚","未婚","未婚","未婚","未婚","未婚","未婚","未婚","未婚","未婚",
            "已婚","未婚","未婚","未婚","未婚","未婚","未婚","未婚","未婚","未婚","已婚","已婚","已婚","已婚"};  //婚姻状况
    String [] birthDate = new String[]{"1989-01-02","1991-03-06","1986-04-02","1978-11-03","1989-05-08","1988-11-22",
            "1983-07-13","1993-01-18","1986-09-05","1988-10-03","1992-04-22","1993-09-08","1990-07-04","1989-10-23","1989-05-28","1990-10-02","1990-01-05",
            "1993-02-01","1990-06-28","1987-11-23","1989-03-24","1990-09-14","1991-04-05","1991-02-09","1990-03-19","1990-06-07",
            "1991-07-21","1991-08-08","1990-01-14","1991-11-23","1991-02-05","1990-05-22","1991-12-23","1989-09-20","1990-01-15",
            "1987-08-01","1991-03-16","1992-08-22","1991-10-15","1990-07-17","1990-10-12","1992-04-12","1991-03-11","1991-12-05","1992-08-14",
            "1970-07-16","1980-01-14","1972-04-23","1979-10-22" };                                   //出生年月 （注：填写格式为19xx-xx-xx）
    String [] phoneNumber = new String[]{"13187895933","13722787899","13858965736","13985845857","13733322222","13521210155",
            "13662895723","13552787288","13856765736","13185855822","13187195933","13722487899","13158922736","13711145857","13965657777","13521266155",
            "13116895933","13433487888","13835358974","13611245858","13392295933","13927487897","13265932736","13188145855","13977657777","13568266155",
            "13777552121","13455487499","13958622733","13882145850","135000487899","13495922736","13965645857","13387196953","13566487811",
            "13217895933","13399987899","13578978736","13085645867","13731155222","13831310152","13622667899","13458565735","13762645852","13032399922",
            "13755566622","13052788288","13226765737","13085655862"};                                //手机号（注：号码为11位数）
    String [] officeSeat = new String[]{"0101","0102","0103","0104","0105","0106","0201","0202","0203","0204",
            "0301","0302","0303","0304","0305","0306","0307","0308","0309","0310","0311","0312",
            "0313","0314","0315","0316","0317","0318","0319","0320","0321","0322","0323","0324","0325",
            "0401","0402","0403","0404","0405","0406","0407","0408","0409","0410","0801","0802","0803","0804"};  //办公座位
    String [] mailAddress= new String[]{"zn124578@qq.com","yulan11@qq.com","wenqing22@qq.com","xixi66@gmail.com","haiqing12@qq.com","liping@qq.com",
            "dongqin1@qq.com","guipingyy@qq.com","ky8988@qq.com","fengxia@qq.com","maoren1@qq.com","jinyun@qq.com","junmei1@qq.com","sbao121@gmail.com",
            "yunxiao@qq.com","wenming@qq.com","huansuo@qq.com","wenli1212@qq.com","haibaoyy@gmail.com","mikegaoa@qq.com","ruijun11@qq.com","wenjun1@qq.com",
            "feixiong2@qq.com","liujyu1@gmail.com","zhixin1@qq.com","wenzhong@qq.com","shuangz11@qq.com","shand2@qq.com","zhiqiang2@qq.com","renyi1@gmail.com",
            "shuaqi@qq.com","caiwu@gmail.com","xiaoren2@qq.com","danyuyy@qq.com","ziying22@qq.com","xiejun22@qq.com","xifeng33@qq.com","supu7@qq.com",
            "lifeng616@gmail.com","lizheng8@qq.com","xiaofan12@qq.com","lifeng22@qq.com","chenfei2@qq.com","shaohong3@gmail.com","dandan99@qq.com",
            "yulingp1@qq.com","lanfenglu2@qq.com","bingbingliu@qq.com","renqingtt@qq.com"};          //邮箱
    String [] address = new String[]{"上海市普陀区田广花苑2幢202室","上海市静安区常宁苑32号501室","上海市曹家渡鑫康苑3号303室","上海市闵行区春申丽园21号201室",
            "上海市普陀区绿洲公寓2幢1302室","上海市静安区瑶溪小区20幢101室","上海市松江区华天公寓33幢602室","上海市静安区静安鑫华苑3号1302室","上海市闵行区古美一村23号403室",
            "上海市闵行区吴中新云城33幢603室","上海市闵行区绿恒花苑12幢203室","上海市青浦区春色苑30号503室","上海市松江区鑫添苑3号303室","上海市闵行区古美八村2号301室",
            "上海市普陀区祥和公寓208幢102室","上海市静安区春田小区21幢701室","上海市崇明区绿春苑10号703室","上海市松江区金堂苑13号303室","上海市闵行区古美新村12号501室",
            "上海市松江区田玲独院3号703室","上海市静安区暨南花苑121幢203室","上海市青浦区光新苑130号1203室","上海市松江区光听风苑33号403室","上海市闵行区古美三村212号201室",
            "上海市普陀区祥和公寓20幢902室","上海市静安区石泉小区2幢601室","上海市闵行区沙田苑100号1703室","上海市松江区星河苑10号703室","上海市闵行区双山公寓13号701室",
            "上海市松江区甘泉小区103号203室","上海市闵行区吴江花苑12幢1203室","上海市青浦区浒苔苑230号502室","上海市松江区吴廷花园23号403室","上海市闵行区古美一村2号301室",
            "上海市普陀区风凌天公寓20幢102室","上海市长宁区泰山一苑29幢702室","上海市卢湾区长华苑503号501室","上海市静安区普天新城55号103室","上海市闵行区天华园321号202室",
            "上海市普陀区君悦宫苑22幢102室","上海市静安区高荣花苑120幢101室","上海市卢湾区景安花苑32号901室","上海市青浦区达安大厦51号303室","上海市闵行区蓝朝庭院21号203室",
            "上海市普陀区桂花公寓45幢1802室","上海市长宁区天富公寓3幢802室","上海市静安区菲戈花苑13号102室","上海市闵行区望亭新都223号903室","上海市闵行区华都鑫城202幢1603室"};  //通讯地址
    String [] qq = new String[]{"1452288","525214","1582458","15847596","2848855","854566774","54847855","1215141221","12569","8584462","99552","57746265554",
            "245221","788465","85132458","164483165546","6485461","4468484465","24848151","818321666","958992699","5586568886",
            "878686466","87777878564","98935326","455156","45856533","225525","585466","66565569","996599666", "555556988","8788456",
            "88566562","8448524844","565215484","8584666","464648","4548477","7778854","8925558862","52111","8747516611","443222333","749565","82154","858486222",
            "958846","41222122","5585755","6595336","84487","513188559"};  //QQ号码
    String [] weChat = new String[]{"zn124578","yulan11","wenqing22","xixi66","haiqing12","liping","dongqin1","guipingyy","ky8988","fengxia",
            "maoren1","jinyun","junmei1","sbao121","yunxiao","wenming","huansuo","wenli1212","haibaoyy","mikegaoa","ruijun11"
            ,"wenjun1","feixiong2","liujyu1","zhixin1","wenzhong","shuangz11","shand2","zhiqiang2","renyi1","shuaqi12","caiwu23","xiaoren2","danyuyy","ziying22",
            "xiejun22","xifeng33","supu7","lifeng616","lizheng8","xiaofan12","lifeng22","chenfei2","shaohong3","dandan99","yulingp1","lanfenglu2","bingbingliu","renqingtt"};  //微信号

    String [] eduExperience = new String[]{"2008年09月至2012年6月 天津城市学院 行政管理专业","毕业院校： 中山大学自考独立本科\n最高学历： 本科 毕业- 2008-04-01   所学专业一： 行政管理\n2010-09 2013-06 韶关学院 行政管理 毕业证\n2013-04 2015-04 中山大学自考本科 行政管理 ","毕业院校： 湘南学院\n" +
            "最高学历： 本科　　获得学位: 管理学士学位 毕业日期： 2009-06\n" +
            "专 业 一： 人力资源管理\n" +
            "2005-09  2009-06  湘南学院  人力资源管理  本科、学士学位证、三级人力资源管理师","教育经历 \n" +
            " 2006-09 ～ 2009-06 湛江市徐闻第一中学 理科 高中\n" +
            "培训经历\n" +
            "2009-02 ～ 2009-06 湛江市职业培训技校 商务文秘  ","教育经历\n" +
            "2006-09 ～ 2009-07 荆州长江大学 商务管理 大专\n" +
            "2003-09 ～ 2006-07 实验高中 文理兼读 高中\n" +
            "培训经历\n" +
            "2011-09 ～ 2015.10 中心人才市场 企业人力资源管理师(三级)" ,"毕业院校： 广州市广播电视大学总校\n" +
            "　　最高学历： 本科\n" +
            "　　获得学位: 毕业日期： 2008-03\n" +
            "　　专 业 一： 工商管理\n" +
            "　　专 业 二： 计算机网络应用设计\n" +
            "　　2001-09 2004-01 广州市越秀成人中专 计算机网络应用设计 计算机4级证 -\n" +
            "　　2004-03 2006-01 广州市广播电视大学越秀分校 工商企业管理 CBMA中国商务营销师","2003年7月 - 2007年7月 澳洲科廷大学会计本科。\n" +
            "主修课程：商务沟通技巧 、企业组织与经营环境、商务运营管理、商务管理综合应用等\n" +
            "2000年7月 - 2003年7月 广州番禺职业技术学院工商企业管理大专\n" +
            "主修课程：人力资源开发与管理、管理基础与实务、办公室事务管理、商务礼仪等"," 2013.7-2014.7 澳洲科廷大学 商学院 会计专业。","2012年9月 - 2015年4月 华南师范大学金融管理本科。"," 2010年9月 - 2013年7月 南京审计学院会计本科。",
            "2009.09 - 2012.06 武汉大学\n" +
                    "专业：工商管理 \n" +
                    "学历：硕士\n" +
                    "是否统招：是\n" +
                    "2000.09 - 2004.06 武汉大学\n" +
                    "专业：计算机通信工程 \n" +
                    "学历：本科\n" +
                    "是否统招：是","2002/09 - 2006/07 河北理工大学 计算机科学与技术专业 本科","毕业学校： 石家庄经济学院 时间： 2004-09至 2006-06\n" +
            "　　专 业： 计算机科学与技术 学历： 本科\n" +
            "　　专业描述： 更加深入学习数据库系统与原理，软件工程，操作系统，数据结构，数值分析，算法分析等相关专业课程。为自己能够深入的开发打下了良好基础。期间深入学习.net有关知识，能够熟练运用c#.net,asp.net(c#)开发基于b/s和c/s的多层结构系统","毕业学校： 石家庄法商职业学院 时间： 2001-09至 2004-06\n" +
            "　　专 业： 计算机信息管理 学历： 大专\n" +
            "　　专业描述： 熟悉信息系统开发流程及信息系统的后期管理.能够运用asp编写数据库后台程序，熟练使用sql server 2000,灵活运用sql语言进行数据查询","2002/09 - 2006/07 河北理工大学 计算机科学与技术专业 本科","2005年9 月 至 2009年7月 陕西省咸阳师范学院\n" +
            "　　计算机科学与技术 本科\n" +
            "　　专业描述： 主修计算机科学与技术专业，同时具有师范类教育背景，拥有国家颁发的教师资格证书。 计算机相关课程有： C语言，数据结构，操作系统，网络原理等等国家规定本科教育课程 同时从大三开始自修基于C#的B/S一线课程，包括Html，JavaScript，Sql Server，Oracle，Ado.net， Asp.net C#语言程序设计等等。 同时也学习了PD，EA，Project，CodeSmith等工具的使用","乔布大学\n" +
            "计算机科学与技术\n" +
            "学士学位 2008-2012\n" +
            "毕业论文\n" +
            "《局域网文件共享及检索系统》\n" +
            "2011年初破解某网络游戏外挂加密算法，自写软件解除其使用期限","毕业学校： 石家庄法商职业学院  时间：  2001-09至 2004-06  \n" +
            "专 业： 计算机信息管理  学历： 大专  ","毕业学校： 石家庄经济学院  时间：  20010-09至 2012-06  \n" +
            "专 业： 计算机科学与技术  学历： 本科  ","1997年9月 - 2015年7月\t湛江电大\t专科","毕业院校： 广东松山学院\n" +
            "　　最高学历： 大专\n" +
            "　　毕业日期： 2009-07-01"
            ,"毕业院校： 广东松山学院\n" +
            "　　最高学历： 大专\n" +
            "　　毕业日期： 2009-07-01","毕业院校：北京工业大学 2011.9--2015.7 工业电器自动化专业\n" +
            "　　主修课程：自控原理，电力拖动，电子技术，自动测试系统，计算机组织与结构，计算机硬件及接口电路设计，汇编语言程序设计，c.c++程序设计，软件工程计算机网络原理等课程\n" +
            "　　另：其他培训情况\n" +
            "　　微软认证系统工程师培训","毕业院校： 武汉工程大学\n" +
            "　　最高学历： 本科\n" +
            "　　获得学位:\n" +
            "　　毕业日期： 2012-06\n" +
            "　　专 业 ：机械设计及其自动化","2010-09 2014-07 武汉工程大学 机械设计制造及其自动化(机械电子工程方向) ","学　历：本科   专　业：电子信息科学与技术\n" +
            "　　学　校：广东海洋大学","2009/8— 2013/6 广东海洋大学 电子信息科学与技术 本科","毕业院校：清华大学\n" +
            "　　最高学历：本科\n" +
            "　　毕业日期：2012-07\n" +
            "　　专业：电气工程及其自动化","毕业院校：华南师范大学\n" +
            "　　最高学历：本科毕业-2012-07-31\n" +
            "　　所学专业一：软件工程所学专业二：计算机应用","　毕业学校： 北京化工大学北方学院 时间： 2011-07至 2015-07\n" +
            "　　专 业： 其他 学历： 本科\n" +
            "　　专业描述： 软件工程专业","毕业学校：\t江门职业技术学院\t学　　历：\t专科\n" +
            "专业名称：\t软件工程\t毕业年份：\t2011年","毕业院校： 广东松山学院  \n" +
            "最高学历： 大专 毕业日期： 2009-07-01 \n" +
            "所学专业一： C++软件工程","毕业院校： 华南理工\n" +
            "　　最高学历： 大专 毕业日期： 2013-09-01\n" +
            "　　所学专业： 软件工程 第二专业： 电子电器","2012-07 - 2014-07 江西师范大学 软件工程 本科\n" +
            "　　专业描述： JAVA程序设计，JSP程序设计，J2EE程序设计，面向对象程序设计，C++程序设计，计算机组成原理，Web网页制作，软件项目管理，计算机组装与维护等。","毕业院校：中国人民大学\n" +
            "　　最高学历：本科\n" +
            "　　毕业日期：2012-07\n" +
            "　　专 业：计算机软件",
            "毕业院校：湖南常德电脑大学\n" +
                    "　　最高学历：本科毕业日期：2012-07-01\n" +
                    "　　所学专业一：计算机信息管理所学","毕业院校：湖南常德电脑大学\n" +
            "　　最高学历：本科毕业日期：2014-07-01\n" +
            "　　所学专业一：计算机信息管理所学","2011-9----2014-6  哈尔滨理工大学计算机科学与技术本科","2012-09 ～ 2015-07 海南师范大学 信息与计算科学 本科\n2014-02 ～ 2014-05 希赛网 软件设计师培训","2011/09 - 2014/07    河北理工大学  计算机科学与技术专业   本科","2012/09 - 2015/09    s天津理工大学     计算机科学与技术专业  本科","2011/09—2015/7 北京信息工程学院 电子商务 本科\n" +
            "　　2014/03—2014/06 渥瑞达Symbian OS 嵌入式开发","毕业院校：北京大学\n" +
            "　　最高学历：硕士\n" +
            "　　毕业日期：2014-07\n" +
            "　　专 业：软件工程","毕业学校： 石家庄法商职业学院  时间：  2011-09至 2014-06","2003年9 月 至 2007年6月华东师范大学 政治学与行政学 本科  专业描述：主要学习行政，经济方面的课程，同时也对政治、人力资源、法律等有较多了解。通过专业的学习，获得了比较全面系统的知识，和独立的思考能力;同时在分析和逻辑思维方面获得了很大的提升，同时也打下了很好的文字功底","毕业学校： 常州信息学院  时间：  1998-09至 2000-06  专业：工商管理","毕业学校： 复旦大学  时间：  1999-09至 2002-06  专业：工商管理","毕业学校： 上海交通大学  时间：  1998-09至 2002-06  专业：工商管理","毕业学校： 耶鲁大学  时间：  1998-09至 2002-06  专业：MBA"};//教育经历
    String [] workExperience = new String[]{"2012年06月至2013年6月 颜艺儿童创意部落 任小主持老师 英语老师 实习阶段，上课并主持校区内的活动，策划活动，负责和负责人一起招生宣传。 \n"+"2013年01月至2014年07月 龙港启橙学科英语 助教兼课程顾问。\n 2014年07月至2015年2月 XX夏恩英语 助教兼课程顾问 后因学校拖欠多月工资中教辞职。","公司名称： 韶关市浈江区政府劳动村居委会实习\n起止年月：2015-09 ～ 2015-12   \n公司性质： 政府机关所属行业：市政，公用事业  担任职务： 居委会委员助理    \n工作描述： 学习办公室管理、资料文件整理、文挡归类, 流动人口登记、劳动力情况登记, 各种健康知识宣传，  还有各种居委会事务。   \n离职原因： 实习结束 ","广州市嘉禾贸易有限公司　起止年月：2011-04 ～ 2014-05\n" +
            "工作描述： 人事工作：\n" +
            "1、建立、完善招聘渠道，发布招聘信息，梳理招聘流程，依招聘流程开展招聘，对接派遣公司物流部人员的招聘及跟进公司与集团人员的调配；\n" +
            "2、组织员工进行培训，对培训效果进行评估、反馈，对各部门内部培训提供指导与支持；\n" +
            "3、负责公司的考勤统计，薪资的核算及发放工作； \n" +
            "4、跟进月度绩效考核表的收集、绩效面谈的安排、绩效的核算工作；\n" +
            "5、负责员工的入职、离职、转正、异动等手续办理；\n" +
            "6、负责员工社保、公积金的办理，待遇申领（包括劳务派遣部分），并解释相关的政策；\n" +
            "7、负责档案管理、劳动合同的签订及管理，员工关系的管理；\n" +
            "8、负责人事报表、月度会议所需报表资料的制作及月度、半年度、年度相关人事数据的分析；\n" +
            "行政工作：\n" +
            "1、负责起草通知通告文件和信函；\n" +
            "2、公司规章制度的监督，执行；\n" +
            "3、负责公司会议的组织及会议记录的书写；\n" +
            "4、负责公司固定资产的管理； \n" +
            "5、负责公司月度文具采购的控制与协调；"
            ," 佳创投资有限公司 （2011-07 ～ 2014-08）  \n" +
            " 公司性质：  私营企业 行业类别：  建筑施工与工程 \n" +
            " 担任职位：  人事行政专员  岗位类别： 人力资源专员 \n" +
            " 工作描述：  1.监督执行公司的各项规章制度和管理制度；制定公司各项管理制度、管理办法和各项作业流程，健全和完善公司、各部门岗位职责。\n" +
            "2.负责组织制订公司的发展规划、编报公司年度工作计划 和工作总结，指挥、督促并检查公司下属各部门完成各项工作。\n" +
            "3.负责确定公司部门的设置、定编、定员、定岗；对公司重大的机构变动、人事安排等有建议和调配权。\n" +
            "4.处理公司人事行政后勤各项事宜，经总经理授权后有决定权; \n" +
            "6.负责组织、领导本公司所有员工的业务、技能培训工作，提高员工的专业素质和工作绩效。\n" +
            "7.负责贯彻实施质量管理体系文件内容，按要求做好相关工作的落实与检查工作。\n" +
            "8.定期组织召开公司部门负责人工作例会，总结、研究公司现阶段人事行政状况及管理情况，积极向公司总经理汇报工作、反馈信息；对重大问题或重要事项提出行之有效的方案或意见，供领导决策。"
         ,"山东省松梅公司 (2011-01 ～ 至今)\n" +
            "　　公司性质： 外资企业\n" +
            "　　行业类别： 电子、微电子技术、集成电路\n" +
            "　　担任职位： 行管处处长助理\n" +
            "　　岗位类别： 行政专员\n" +
            "　　工作描述：\n" +
            "　　1.公司各类行政公告拟写及发布，年底制订公司行事历等\n" +
            "　　2.对部门提交单据进行初审，合格后送签处长及副总\n" +
            "　　3.公司行政部各类合同及合约的签署跟进与存档\n" +
            "　　4.每月搜集各课组人员的公司预算及KPI/MBO资料，并整理分析达成情况，制定进一步追踪计划\n" +
            "　　5.每日早会及重要会议资料准备并作好会议记录，负责会议内容的上传下达及完成进度追踪\n" +
            "　　6.协助律师处理公司各种纠纷及讼诉案件，不定时搜集案件相关资料/证明\n" +
            "　　7.公司相关服务厂商的出勤查核及费用请款核销\n" +
            "　　8.在SAP系统中开立人资部物品请购单，并管制部门文具使用"
           ,"　广州尚品宅配集团有限公司\n" +
            "　　起止年月：2010-03 ～ 2012-09\n" +
            "　　担任职位： 招商经理\n" +
            "　　工作描述：\n" +
            "　　1、负责广东，广西，海南，云南，山西，安徽，河南，河北，新疆省份内的区域招商。对加盟商的店面面积，位置，前期投资投入等进行审核审批。负责区域内各个城市的店面开发，与装修公司和各品牌家具企业和各品牌分店老板进行项目洽谈。\n" +
            "　　2、跟进签约后各店的货物余款，店面的设计，装修，产品的下单，余款回收等项目进度跟进。\n" +
            "　　3、参与公司进行的全国各大展会，与全国加盟商进行现场项目解说与企业内部软件使用和投资回报等分析。\n" +
            "　　4、处理各加盟商签约前和签约后的各项异议，包括解释加盟费，保证金，物流货运，售后等一系列异议处理。\n" +
            "　　5、了解各加盟商开店后的活动需求，广告支持和人员派遣，与各区市场负责经理联系解决各店宣传物资物料等申请。","广州市元葵务师事务所有限公司　　 起止年月：2011-08 ～ 2012-06\n" +
            "公司性质： 民营企业　　所属行业：会计/审计\n" +
            "担任职位： 会计助理\n" +
            "工作描述： 主要负责申报税，做全套账，还有帮助新开企业办理工商、代码、国地税税务登记，代理工商登记、变更、注销，跑银行，还有辅佐税务师出企业所得税清缴报告，熟悉做一般纳税人和小规模纳税人的会计帐，熟悉工商税务的办事流程。\n" +
            "离职原因： 实习期限已到\n" +
            "广州市**通信有限公司　　 起止年月：2010-03 ～ 2010-06\n" +
            "公司性质： 国有企业　　所属行业：通信/电信/网络设备\n" +
            "担任职位： 营销员\n" +
            "工作描述： 在公司主要负责电话销售，用最真诚最礼貌的语言打动客人订购铃声达到一定的销售额，表现得很优秀得到领导的好评认可。\n" +
            "离职原因： 学校课程紧张忙着复习考试","\n" +
            "中山友电电机厂   2000-01 - 2000-07 公司性质：电器、电子、通讯设备 担任职位：成本会计 工作职责和业绩：  主要负责：产品生产成本和费用的归集、核算与分析。","起止年月：2009-07 ～ 2011-08\n" +
            "公司性质： 股份制企业　　所属行业：房地产开发\n" +
            "担任职位： 总账会计\n" +
            "工作描述： 1、编制年度费用预算，对执行情况进行分析并提出建议报送管理层；\n" +
            "2、费用报销及付款单据审核，严格管控成本费用支出；\n" +
            "3、负责收入、成本费用、税金等全盘会计账务处理，编制相关报表；\n" +
            "4、撰写财务分析报告；\n" +
            "5、开展合理有效的税务筹划，主持2010年度所得税汇算清缴；\n" +
            "6、维护与税务、银行等外部单位关系，配合国税开展的税务稽查；\n" +
            "7、工资核算。","鼎鑫集团总部大楼项目公司　　 起止年月：2011-08 ～ 2015-01\n" +
            "公司性质： 股份制企业　　所属行业：房地产/建筑\n" +
            "担任职位： 会计主管\n" +
            "工作描述： 1、负责费用报销及付款审核，编制内部财务管理规范及核算流程；\n" +
            "2、指导出纳、费用会计进行资金、账务处理，编制并报送会计报表；\n" +
            "3、统筹2011年度资产盘点，编写盘点报告；\n" +
            "4、编制2012年度经营预算；\n" +
            "5、协助部门领导做好本部门员工的培训工作；\n" +
            "6、会计凭证、合同及相关财务资料的整理与归档；\n" +
            "7、兼任美的小学财务负责人，主管美的小学财务工作",
            "2008.02 - 2014.04  北京古耐奥信息技术有限公司  开发部 | 互联网研发工程师 工作描述： 主要负责公司新平台和新产品的功能分析、架构、编码、测试工作。公司主要产品有网上报告厅以及职业培训平台。","2007 /11--2013.10：北京博惠思华信息技术有限公司广州分公司 所属行业： 计算机软件  实施部  软件实施顾问 ","2006/07 - 2013/06 上海新致软件 PG\n" +
            "　　职责：从事Java、jsp、struts等代码编写;项目测试及日语化。能够阅读，理解日文试样书。日语水平与日语考试3级相当。\n" +
            "　　2008/06 -至今 慧桥信息科技有限公司 Java软件工程师\n" +
            "　　职责：参与项目的开发和实施全过程，完成相应阶段文档编制，如分析、设计、编码、测试等。","2008/06 -至今 慧桥信息科技有限公司 Java软件工程师"
            ,"任职公司名称: 江苏欧索软件有限公司 。\n" +
            "　　2009年9 月 至 2010年8月 软件工程师\n" +
            "　　工作职责和业绩: 软件开发以及软件二次开发 1.上海某区统计局电子台账系统(B/S) 系统采用VS2008 Oracle开发。 主要负责客户端B201表模块的数据上报模块以及管理端的数据审核模块，同时负责消息管理模块的模块开发。项目开发以小组模式共4人，历时3个月,并且负责了该项目的后期交付维护工作。整个项目走CMMI3流程，符合标准的项目管理。 2.苏州某通讯公司沟通维系新平台系统(B/S) 系统采用VS2005 SQL2005开发 主要负责系统中合同管理，客户管理，投诉等模块的开发。同时负责统计模块的开发。包括数据统计，数据报表等等。系统主要为该公司与第三方代维的关系提供维护和管理功能。系统采用小组制共3人，历时3月。项目符合CMMI3标准。 3.苏州移动公司测速系统(B/S) 网站采用VS2008 Oracle开发。","2010年8 月 至 2011年3月 软件工程师\n" +
            "　　工作职责和业绩: 主要负责中兴内部外包形式的项目开发，升级和多语言化方面的工作。项目管理符合CMMI2标准。目前完成的项目有HR人力资源系统，TMS时间管理系统，Ejob网上招聘系统等等项目的开发。开发主要以外包形式，熟悉大型项目的开发流程。","任职公司名称: 江西朗博文通信有限公司 。\n" +
            "　　2011年3 月 至 2011年9月 软件工程师\n" +
            "　　工作职责和业绩: 负责公司移动充值业务与淘宝平台对接，并负责新系统的数据库设计以及后台系统的开发。","北京乔布国际教育咨询有限公司\n" +
            "主要技术负责人\n" +
            "2011.03-至今\n" +
            "阅读大量英文材料，整理网站内容\n" +
            "研究ibm、vault、微软等公司英文网站结构，策划公司网站","北京维度动力信息技术有限公司\n" +
            "手机游戏系统设计开发  2011.04-2011.08\n" +
            "2周内通过研读大量英文技术材料迅速熟悉Brew平台，并与个部门配合 开发期间因技术需要，大量阅读英文文档，进行学习研究\n" +
            "独立完成2个游戏项目，创造性的解决了动画显示方面的技术问题","美国加特纳咨询公司天津分公司技术助理   2010.10-2011.03\n" +
            "在php英文官方站点研读大量文档，突破了1个网站久待解决的技术问题。该突破为公司一项业务提供了合理的解决方案\n" +
            "了解了咨询公司的业务范围运营方式。开阔了作为理工科学生在此类行业方面的视野","网站主创人2009.01-2010.01\n" +
            "著名漫画《名侦探柯南》相关站，拥有注册用户4000多人的论坛\n"+
            "论坛版主，坚持定期发布基于网络的文档、规章\n" +
            "擅长css+jsp+html+php+mysql，3年间全面负责网站的前台美工界面制作、后台程序的开发、已有程序的维护及站点的网络安全问题\n" +
            "进行详细的客户需求分析，用网络投票进行市场调查，根据结果指定发展计划，组织各种活动吸引人气调动论坛讨论气氛\n" +
            "网站内容方面与sohu合作，并定期与同内容网站进行交流"
            ,"公司名称： 北京吴鑫软件公司  \n" +
            "职位名称： 软件工程师  工作时间 ：  2009-08至2009-09  \n" +
            "工作描述： 为河北移动做bi，主要负责bass的后期维护以及系统升级","公司名称： 石家庄天地人软件公司  \n" +
            "职位名称： 软件开发  工作时间 ：  2008-03至2009-06  \n" +
            "工作描述： 负责住房公积金数据库维护工具的软件设计与开发 ","公司名称： 北京甲天下软件公司  \n" +
            "职位名称： 软件开发  工作时间 ：  2006-06至2008-01  \n" +
            "工作描述： 完成gps软件模块的相关设计，编码与测试工作。在美工配合下独立完成网站的开发。 ","公司名称： 石家庄温蒂贸易有限公司  \n" +
            "职位名称： 网站开发与维护  工作时间 ：  2004-04至2004-09  \n" +
            "工作描述： 主要负责公司网站开发与维护。","所在公司：\t深圳炜新电机制造厂\n" +
            "时间范围：\t2015年3月 - 2015年8月\n" +
            "担任职位：\t生产工程部电子工程师\n" +
            "工作描述：\t主要负责电机生产线上的各种设备的研发和维护.","所在公司：\t深圳盟事达科技有限公司\n" +
            "时间范围：\t2015年4月 - 2015年6月  担任职位：\t研发部软件工程师\n" +
            "工作描述：\t主要负责所有新开发设备的电路设计及程序(以PLC为主)设计,管理工程部软件组团队,参与新设备的硬件开发讨论及旧设备改良讨论,制定电气元件的选用方案,协助机械工程师设计最合理的硬件机构等. 在职6年多期间,参加研发及亲手设计程序的设备达数十种,主要有以下:双介面卡自动生产线；护照INLAY(中间层)自动生产线；铣槽机,IC封装机,冲GSM机,上线机,冲卡机,冲孔机,全自动8位芯片检测机,全自动10位个人发机及护照测试中心等等. 其中有些设备可以称超大型,IO达上千点,伺服达40多轴. 产品销往全国及世界各地,本人有多次出国售后服务经验.","所在公司：\t深圳华坤天地科技有限公司\n" +
            "时间范围：\t2015年7月 - 2015年12月 担任职位：\t研发部软件工程师\n" +
            "工作描述：\t主要负责PLC和PC程序设计","公司名称： 深圳点创科技有限公司\n" +
            "　　起止年月：2009-02 ～ 2009-06\n" +
            "　　所属行业：计算机业\n" +
            "　　担任职务： 程序员\n" +
            "　　工作描述： MFC软件开发，做过智能交通调度系统服务端","2010年3月—2012年10月  武田有限公司，担任研发工程师。主要工作是：负责公司产品的改良以及开发新产品。有倒车雷达、防盗报警器、车窗关闭器、智能后视镜等;","996年9月---1998年3月 武汉狮子王有限公司\n" +
            "　　系统管理员/工程师\n" +
            "　　chinagbn internet网络信息中心的系统管理\n" +
            "　　熟练掌握unix(sun solaris)操作系统、网络管理并参与组建了chinagbn internet网络中心(包括网络设计，安装系统，联调，维护，网络编程)","2014/9 – 2015/6：北京市规划司有限公司[9个月]\n" +
            "　　所属行业：计算机软件    研究部——系统软件工程师\n" +
            "　　1. 根据项目具体要求，承担开发任务，按计划完成任务目标\n" +
            "　　2. 配合系统分析人员完成软件系统及模块的需求调研与需求分析\n" +
            "　　3. 配合系统分析人员完成软件系统及模块的设计","2013/5 – 2014/8：无锡康健堂有限公司[1年3个月]\n" +
            "　　所属行业：计算机软件\n" +
            "　　研究部　　系统软件工程师\n" +
            "　　1. 协助测试人员完成软件系统及模块的测试\n" +
            "　　2. 负责项目开发作业程序的执行，严格执行开发设计工作规范\n" +
            "　　3. 负责进行需求调研分析，制定项目需求规格说明书","danyuyy","ziying22",
            "1998/07--至今：杭州同辉网络系统工程有限公司\n" +
                    "　　所属行业：信息技术和互联网(计算机软硬件,通讯)\n" +
                    "　　产品及技术支持部部门经理\n" +
                    "　　1、负责大客户的售前支持；\n" +
                    "　　2、制定新产品的技术支持方案；\n" +
                    "　　3、负责部门日常管理，协调部门内部工作；\n" +
                    "　　4、负责销售人员和技术支持工程师的技术培训。","2012/11--2014/06：美国Wkais计算机有限公司上海办事处\n" +
            "　　所属行业：信息技术和互联网(计算机软硬件,通讯)\n" +
            "　　信息技术部技术支持工程师\n" +
            "　　1、负责产品售前、售后技术支持；\n" +
            "　　2、负责销售渠道和用户的技术培训；"
            ,"2013/07--2016/10：常州时光分信息系统有限公司\n" +
            "　　所属行业：信息技术和互联网(计算机软硬件,通讯)\n" +
            "　　信息技术部系统工程师\n" +
            "　　1、负责为用户进行XX工作站及UNIX系统集成项目支持、服务及培训；\n" +
            "　　2、参与开发SUNSPARC兼容工作站；\n" +
            "　　3、用户售前咨询。\n" +
            "　　工作业绩：\n" +
            "　　1、参与建立了连锁超市收银系统；\n" +
            "　　2、编制公司内部人事财务管理系统。","公司名称： 北京合力金桥软件有限责任公司\n" +
            "　　职位名称： 软件工程师 工作时间 ： 2014-07至2015-07\n" +
            "　　工作描述：\n" +
            "　　1、联通呼叫中心客服系统开发。提供软电话、业务办理、坐席监控等功能。\n" +
            "　　2、产品级软件的开发。参与开发过“绩效管理系统”和“上下位管理系统”。\n" +
            "　　3、中间件(cics,tongeasy)服务应用的开发。呼叫中心系统采用三层结构，中间件服务是在unix下使用Pro*c开发。","公司名称： 深圳点创科技有限公司起止年月：2010-02 ～ 2014-06 \n" +
            "            \"公司性质： 民营企业所属行业：计算机业 \\n\" +\n" +
            "            \"担任职务： 程序员 工作描述： MFC软件开发，做过智能交通调度系统服务端","xx年3月—至今  重庆丹妃帝有限公司，担任部门经理。主要工作是：\n" +
            "　　1、负责大客户的售前支持；\n" +
            "　　2、制定新产品的技术支持方案；\n" +
            "　　3、负责部门日常管理，协调部门内部工作；\n" +
            "　　4、负责销售人员和技术支持工程师的技术培训。","公司名称： 深圳航天无线通信技术有限公司 起止年月： 2012-06 ～ 2013-08\n" +
            "　　公司性质： 外商独资 所属行业： 通信/电信/网络设备\n" +
            "　　担任职务： 嵌入式软件工程师\n" +
            "　　工作描述： 负责该项目的软件开发工作;根据项目需求分析进行系统框架和核心模块的详细设计;参与项目组产品需求分析和软件方案制定;编写相应的通讯协议等各类技术文档;编写生产用的产品测试软件并记录质量测试结果;参与硬件电路的设计审核和无源GPS天线的调试工作。","公司名称： 深圳孚道数码科技有限公司 起止年月： 2011-03 ～ 2012-04\n" +
            "　　公司性质： 私营企业 所属行业： 电子技术/半导体/集成电路\n" +
            "　　担任职务： 软件工程师\n" +
            "　　工作描述： 负责公司方案产品应用层的软件开发。公司新成立前期定位广告机和平板电脑，前三个月从事士兰(SC8636)和Amlogic(AML6222E)方案的广告机公板代码，后公司领导层根据市场订单转变策略，决定做CD播放器，引入三星的S5L8035方案和凌阳的SPHE8104L方案，在公板基础上，根据客户需求，逐步完善各项功能，现已有近30余家客户使用我司CD播放器方案，方案各项功能基本已全部完善且稳定运行，方案内现已集成市面上95%以上的显示驱动程序，各项功能可以方便地以宏控制来开启或关闭功能，方案框架和功能都已全部实现，后期仅需简单维护即可。","公司名称： 广州华蓝佳声计算机科技有限公司 起止年月： 2010-01 ～ 2011-03\n" +
            "　　公司性质： 私营企业 所属行业： 电力/水利\n" +
            "　　担任职务： 嵌入式硬件/软件工程师\n" +
            "　　工作描述： 负责公司新产品开发，手持无线数据采集器的模块硬件和驱动程序开发。Layout四层44B0主板和六层的2440核心板;完成了RFID电子标签高频 RC531的软硬件开发，超高频RMU900的软硬件开发，GPRS通信协议的制定与软硬件的开发、指导同事完成上位机服务器程序的开发。\n" +
            "　　该产品用于电力无线抄表。硬件上主要采用ARM7的44B0和AMR9的2440、13.56M的非接触读写芯片RC531、915M超高频模块RMU900、广和通的GPRS模块G600、三洋的LB1836M热敏打印电机驱动等。","公司名称： 广州优管电子科技有限公司 起止年月： 2007-02 ～ 2009-09\n" +
            "　　公司性质： 中外合资 所属行业： 通信/电信/网络设备\n" +
            "　　担任职务： 嵌入式硬件/软件工程师\n" +
            "　　工作描述： 负责公司自动售货机(羊城通增值服务)的无线通信软件工作、GPRS驱动程序、RFID模块的驱动程序、电子门禁程序、μCOS-II移植以及项目经理分配的其它模块开发任务和硬件电路设计布板等工作。\n" +
            "　　该产品使用ARM7的LPC2138为主控、华为的GPRS模块GTM900、13.56M的非接触读写芯片PN532等。","翔容建营销策划北京有限公司上海分公司  2007年7 月 至 2009年3月 项目管理与客户执行 工作职责和业绩:  一、协助负责操作TI、ADI、RBI等项目   二、进行出入库商品的统计，仓储数据报表的统计和分析  三、负责公司物流部门库存报表的汇总与整理   四、与各大运输公司合作,进行物品等的发送,并进行物流货品配送的追踪反馈及回单的整理工作   五、每月底完成相关物流费用,完成各种单据发票整理，shipment details制作等","一、2001/11--2001/11：参与太极集团广告处组织的市场策划人员初级课程培训\n" +
            "　　内容：广告学基础/品牌管理与规划/媒介策划、投放、管理\n" +
            "　　二、2003/08--2003/08：参与太极集团人事处组织的企业债权债务管理培训\n" +
            "　　内容：企业财务基础/应收账款管理/清欠技巧","武汉通达公司 (2005-03 ～ 2012-12)\n" +
            "　　公司性质： 民营企业 行业类别： 咨询与调查业(顾问、企业管理、知识产权)\n" +
            "　　担任职位： 人力资源主管 岗位类别： 人事经理/主管\n" +
            "　　工作描述： 1、全面负责公司人员招聘工作，满足公司业务及项目需求;\n" +
            "　　2、负责公司考勤薪资、社保福利项目的核算缴付;\n" +
            "　　3、作为项目助理负责项目前期与客户的联系沟通，并协助项目文件的整理交付;\n" +
            "　　4、全面整理规范公司前期项目文件资料;","天津胡迪有限公司 (2008-03 ～ 2012-05)\n" +
            "　　担任职位： 人事行政主管 岗位类别： 人事经理/主管\n" +
            "　　工作描述： 1、负责公司规章制度与分店人事行政各项工作的宣导、执行与管理;\n" +
            "　　2、协助总部人力资源部、行政部进行制度编写等工作的完善;\n" +
            "　　3、负责分店各类相关人事行政工作报表、单据的审核、确认与反馈;\n" +
            "　　4、负责分店员工考勤、薪酬、绩效评估、人员异动等情况的分析及处理;\n" +
            "　　5、负责分店培训需求的调查，培训计划的制订，培训活动的组织与开展，培训结果总结及效果反馈与跟进;\n" +
            "　　6、负责分店员工关系管理及分店康体活动的策划、组织与开展;"};//工作经历




    //    protected DataBase(Parcel deptNames[],staffsName[],staffNumbers[],avatar[],position[],sex[],nativePlace[],nationalities[],nation[],maternityStatus[],
//                       birthDate[], phoneNumber[],officeSeat[],mailAddress[],address[],qq[],weChat[]) {
//
//    }
    // ∴也可以将Parcel看成是一个流，通过writeToParcel把对象写到流里面，在通过createFromParcel从流里读取对象，只不过这个过程需要你来实现，因此写的顺序和读的顺序必须一致。
    //还必须含有一个名称为CREATOR的静态成员，该成员对象要求实现Parcelable.Creator接口及其方法

//
//     public DataBase(String[]deptNames,String[]staffsName,String[]staffNumbers,String[]avatar,String[]position,String[]sex,String[]nativePlace,String[]nationalities,String[]nation,
//                    String[]maternityStatus,String[]birthDate,String[]phoneNumber,String[]officeSeat,String[]mailAddress,String[]address,String[]qq,String[]weChat) {
//        this.deptNames= deptNames;
//        this.staffsName = staffsName;
//        this.staffNumbers= staffNumbers;
//        this.avatar = avatar;
//        this.position= position;
//        this.sex = sex;
//        this.nativePlace= nativePlace;
//        this.nationalities = nationalities;
//        this.nation= nation;
//        this.maternityStatus = maternityStatus;
//        this.birthDate= birthDate;
//        this.phoneNumber = phoneNumber;
//        this.officeSeat= officeSeat;
//        this.mailAddress = mailAddress;
//        this.address= address;
//        this.qq = qq;
//        this.weChat= weChat;

//    }
//
//    protected DataBase(Parcel in) {
//        deptNames = in.createStringArray();
//        staffsName = in.createStringArray();
//        staffNumbers = in.createStringArray();
//        avatar = in.createStringArray();
//        position = in.createStringArray();
//        sex = in.createStringArray();
//        nativePlace = in.createStringArray();
//        nationalities = in.createStringArray();
//        nation = in.createStringArray();
//        maternityStatus = in.createStringArray();
//        birthDate = in.createStringArray();
//        phoneNumber = in.createStringArray();
//        officeSeat = in.createStringArray();
//        mailAddress = in.createStringArray();
//        address = in.createStringArray();
//        qq = in.createStringArray();
//        weChat = in.createStringArray();
//    }
//
//    public static final Creator<DataBase> CREATOR = new Creator<DataBase>() {
//        @Override
//        public DataBase createFromParcel(Parcel in) {
//            return new DataBase(in);
//        }
//
//        @Override
//        public DataBase[] newArray(int size) {
//            return new DataBase[size];
//        }
//    };
//
//    @Override
//    public int describeContents() {
//        return 0;
//    }
//
//    @Override
//    public void writeToParcel(Parcel parcel, int i) {
//        //把数据写入Parcel
//        parcel.writeStringArray(deptNames);
//        parcel.writeStringArray(staffsName);
//        parcel.writeStringArray(staffNumbers);
//        parcel.writeStringArray(avatar);
//        parcel.writeStringArray(position);
//        parcel.writeStringArray(sex);
//        parcel.writeStringArray(nativePlace);
//        parcel.writeStringArray(nationalities);
//        parcel.writeStringArray(nation);
//        parcel.writeStringArray(maternityStatus);
//        parcel.writeStringArray(birthDate);
//        parcel.writeStringArray(phoneNumber);
//        parcel.writeStringArray(officeSeat);
//        parcel.writeStringArray(mailAddress);
//        parcel.writeStringArray(address);
//        parcel.writeStringArray(qq);
//        parcel.writeStringArray(weChat);
//    }

}
